Model: "functional_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(8, 16000)]              0         
_________________________________________________________________
feature_layer (SpeechFeature (8, 49, 30)               0         
_________________________________________________________________
tf_op_layer_ExpandDims (Tens [(8, 49, 30, 1)]          0         
_________________________________________________________________
tf_op_layer_Reshape (TensorF [(8, 49, 1, 30)]          0         
_________________________________________________________________
first_conv (Conv2D)          (8, 49, 1, 36)            1116      
_________________________________________________________________
first_bn (BatchNormalization (8, 49, 1, 36)            144       
_________________________________________________________________
first_act (Activation)       (8, 49, 1, 36)            0         
_________________________________________________________________
dw0 (DepthwiseConv2D)        (8, 49, 1, 36)            144       
_________________________________________________________________
pw0 (Conv2D)                 (8, 49, 1, 36)            1332      
_________________________________________________________________
bn0 (BatchNormalization)     (8, 49, 1, 36)            144       
_________________________________________________________________
act0 (Activation)            (8, 49, 1, 36)            0         
_________________________________________________________________
dw1 (DepthwiseConv2D)        (8, 49, 1, 36)            144       
_________________________________________________________________
pw1 (Conv2D)                 (8, 49, 1, 36)            1332      
_________________________________________________________________
bn1 (BatchNormalization)     (8, 49, 1, 36)            144       
_________________________________________________________________
act1 (Activation)            (8, 49, 1, 36)            0         
_________________________________________________________________
dw2 (DepthwiseConv2D)        (8, 49, 1, 36)            144       
_________________________________________________________________
pw2 (Conv2D)                 (8, 49, 1, 36)            1332      
_________________________________________________________________
bn2 (BatchNormalization)     (8, 49, 1, 36)            144       
_________________________________________________________________
act2 (Activation)            (8, 49, 1, 36)            0         
_________________________________________________________________
dw3 (DepthwiseConv2D)        (8, 49, 1, 36)            144       
_________________________________________________________________
pw3 (Conv2D)                 (8, 49, 1, 36)            1332      
_________________________________________________________________
bn3 (BatchNormalization)     (8, 49, 1, 36)            144       
_________________________________________________________________
act3 (Activation)            (8, 49, 1, 36)            0         
_________________________________________________________________
dw4 (DepthwiseConv2D)        (8, 49, 1, 36)            144       
_________________________________________________________________
pw4 (Conv2D)                 (8, 49, 1, 36)            1332      
_________________________________________________________________
bn4 (BatchNormalization)     (8, 49, 1, 36)            144       
_________________________________________________________________
act4 (Activation)            (8, 49, 1, 36)            0         
_________________________________________________________________
dw5 (DepthwiseConv2D)        (8, 49, 1, 36)            144       
_________________________________________________________________
pw5 (Conv2D)                 (8, 49, 1, 36)            1332      
_________________________________________________________________
bn5 (BatchNormalization)     (8, 49, 1, 36)            144       
_________________________________________________________________
act5 (Activation)            (8, 49, 1, 36)            0         
_________________________________________________________________
pool (AveragePooling2D)      (8, 1, 1, 36)             0         
_________________________________________________________________
last_conv (Conv2D)           (8, 1, 1, 12)             444       
_________________________________________________________________
tf_op_layer_reshape_1 (Tenso [(8, 12)]                 0         
=================================================================
Total params: 11,424
Trainable params: 10,920
Non-trainable params: 504
_________________________________________________________________